# Task 4.6

## Importing Libraries

In [47]:
# importing libraries 
import pandas as pd 
import numpy as np 
import os

## Importing Data

In [49]:
# Path Variable 
path = r'C:\Users\jmiel\JENNY_STUFF\MY_DOCS\CareerFoundry\Instacart Basket Analysis'

# Importing orders_products_combined data frame
df_ords_prods_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

# Remove previous merged flag 
df_ords_prods_combined = df_ords_prods_combined.drop('_merge', axis = 1)

# Importing df_prods 
df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)
# Drop unnamed: 0 index 
df_prods = df_prods.drop('Unnamed: 0', axis = 1)

In [50]:
# Check shape to verify output 
# The shape is the same as before
df_ords_prods_combined.shape

(32434489, 10)

In [51]:
# Check to verify output 
df_prods.shape

(49672, 5)

In [52]:
df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

In [53]:
df_ords_prods_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,True,196,1,0
1,2539329,1,1,2,8,NaN,True,14084,2,0
2,2539329,1,1,2,8,NaN,True,12427,3,0
3,2539329,1,1,2,8,NaN,True,26088,4,0
4,2539329,1,1,2,8,NaN,True,26405,5,0

## Combine df_prods to df_ords_prods_combined

In [55]:
# merge dataframes 
df_ords_merged = df_ords_prods_combined.merge(df_prods, on = 'product_id', indicator = True)

In [56]:
# Check output
df_ords_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,True,196,1,0,Soda,77,7,9.0,both
1,2539329,1,1,2,8,NaN,True,14084,2,0,Organic Unsweetened Vanilla Almond Milk,91,16,12.5,both
2,2539329,1,1,2,8,NaN,True,12427,3,0,Original Beef Jerky,23,19,4.4,both
3,2539329,1,1,2,8,NaN,True,26088,4,0,Aged White Cheddar Popcorn,23,19,4.7,both
4,2539329,1,1,2,8,NaN,True,26405,5,0,XL Pick-A-Size Paper Towel Rolls,54,17,1.0,both

In [66]:
# Run a frequency check on _merged column 
df_ords_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [68]:
# The df_ords_merged dataframe does not contain every single record as indicated in the frequency check.
# This proves that an inner join was done
df_ords_merged_how = df_ords_prods_combined.merge(df_prods, on = 'product_id', indicator = True, how = 'outer')

In [70]:
# Frequency Check 
df_ords_merged_how['_merge'].value_counts()

_merge
both          32404859
left_only        30200
right_only          11
Name: count, dtype: int64

## Export Dataframe

In [75]:
df_ords_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merged.pkl'))